;; -*- no-byte-compile: t; -*-
;;; private/selectrum/packages.el

(package! prescient)

(package! selectrum)
(package! selectrum-prescient)

(package! consult)
(package! consult-flycheck)

(package! embark)
(package! embark-consult)

(package! marginalia)

(package! orderless)

(package! wgrep)
